## RQ1

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('/Users/tommy/Desktop/ADM-5/wikigraph_reduced.csv', delim_whitespace=True)

In [3]:
data.head()

        0        1
796    95  1185516
909   108  1059989
910   108  1062426
911   108  1161925
1141  134   541222

Loops checking: if a edge starts from a node and goes into the same node we have loops.

In [8]:
for i in range(len(data)):
    if data.iloc[i][0] == data.iloc[i][1]:
        print(data.iloc[i],'yes')
        break

0    27676
1    27676
Name: 534214, dtype: int64 yes

the graph cointains loop

Checking if the graph is oriented and if it has multiple direction links

In [9]:
data1 = data         #duplicating the dataframe

In [10]:
prova = data.merge(data1, left_on='1', right_on='0')   #merging on the same value

In [15]:
for i in range(len(prova)):
    if prova.iloc[i][0] == prova.iloc[i][-1]:
        print(i,'yes')
        break

36 yes

We proved that is oriented and that there are multiple links
Now we took a node for example and we calculated how many multiple links it has

In [16]:
prova1 = prova.iloc[36]
prova1

0_x     137144
1_x    1059989
0_y    1059989
1_y     137144
Name: 36, dtype: int64

In [17]:
l = list(prova1.unique())

In [18]:
col1 = data.loc[data['0']== l[0]] #link that starts from selected node
col2 = data.loc[data['1']== l[0]] #link that go into the selected node

In [19]:
col1

              0        1
2455575  137144   687546
2455576  137144   688739
2455577  137144  1059989
2455578  137144  1060884
2455583  137144  1151659

In [20]:
col2

                0       1
10550781   687546  137144
10565955   688739  137144
15982588  1059989  137144
16055893  1060884  137144

In [21]:
a = []
b = []
for i in range(len(col1)):
    a.append(col1.iloc[i,1])
for j in range(len(col2)):
    b.append(col2.iloc[j,0])


A = set(a)
B = set(b)
A.intersection(B)

{687546, 688739, 1059989, 1060884}